Revit 2024 API
InitialLuminousIntensity Class
 This class encapsulates initial luminous intensity calculation.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class InitialLuminousIntensity : InitialIntensity
Visual Basic
Public Class InitialLuminousIntensity _
	Inherits InitialIntensity
Visual C++
public ref class InitialLuminousIntensity : public InitialIntensity
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
See Also
InitialLuminousIntensity Members
Autodesk.Revit.DB.Lighting Namespace